app/controllers/encomendas_controller.rb

  def index
    @encomendas = Encomenda.all
---
SELECT "encomendas".* FROM "encomendas"

    def set_encomenda
      @encomenda = Encomenda.find(params[:id])
---
SELECT "encomendas".* FROM "encomendas" WHERE "encomendas"."id" = $1 LIMIT $2  [["id", nil], ["LIMIT", 1]]